---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarHandlesData Properties
RebarHandlesData Class See Also Send Feedback
---

The RebarHandlesData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandlesData Class

Autodesk.Revit.DB.Structure Namespace